public class Main {
    public static void main(String[] args) {
        int amountBilet = 20_000; // 20000 рублей стоимость билета
        int mili = amountBilet / 20; // 1 миля за каждые 20 рублей
        System.out.println("Начисленные мили:" + mili);

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}